ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F3xx/stm32f378xx.h
/******************  Bit definition for SDADC_CLRISR register  ****************/
#define SDADC_ISR_CLREOCALF_Pos       (0U)                                     
#define SDADC_ISR_CLREOCALF_Msk       (0x1U << SDADC_ISR_CLREOCALF_Pos)        /*!< 0x00000001 */
#define SDADC_ISR_CLREOCALF           SDADC_ISR_CLREOCALF_Msk                  /*!< Clear the end of calibration flag */
#define SDADC_ISR_CLRJOVRF_Pos        (2U)                                     
#define SDADC_ISR_CLRJOVRF_Msk        (0x1U << SDADC_ISR_CLRJOVRF_Pos)         /*!< 0x00000004 */
#define SDADC_ISR_CLRJOVRF            SDADC_ISR_CLRJOVRF_Msk                   /*!< Clear the injected conversion overrun flag */
#define SDADC_ISR_CLRROVRF_Pos        (4U)                                     
#define SDADC_ISR_CLRROVRF_Msk        (0x1U << SDADC_ISR_CLRROVRF_Pos)         /*!< 0x00000010 */
#define SDADC_ISR_CLRROVRF            SDADC_ISR_CLRROVRF_Msk                   /*!< Clear the regular conversion overrun flag */

/******************  Bit definition for SDADC_JCHGR register  *****************/
#define SDADC_JCHGR_JCHG_Pos          (0U)                                     
#define SDADC_JCHGR_JCHG_Msk          (0x1FFU << SDADC_JCHGR_JCHG_Pos)         /*!< 0x000001FF */
#define SDADC_JCHGR_JCHG              SDADC_JCHGR_JCHG_Msk                     /*!< Injected channel group selection */
#define SDADC_JCHGR_JCHG_0            (0x001U << SDADC_JCHGR_JCHG_Pos)         /*!< 0x00000001 */
#define SDADC_JCHGR_JCHG_1            (0x002U << SDADC_JCHGR_JCHG_Pos)         /*!< 0x00000002 */
#define SDADC_JCHGR_JCHG_2            (0x004U << SDADC_JCHGR_JCHG_Pos)         /*!< 0x00000004 */
#define SDADC_JCHGR_JCHG_3            (0x008U << SDADC_JCHGR_JCHG_Pos)         /*!< 0x00000008 */
#define SDADC_JCHGR_JCHG_4            (0x010U << SDADC_JCHGR_JCHG_Pos)         /*!< 0x00000010 */
#define SDADC_JCHGR_JCHG_5            (0x020U << SDADC_JCHGR_JCHG_Pos)         /*!< 0x00000020 */
#define SDADC_JCHGR_JCHG_6            (0x040U << SDADC_JCHGR_JCHG_Pos)         /*!< 0x00000040 */
#define SDADC_JCHGR_JCHG_7            (0x080U << SDADC_JCHGR_JCHG_Pos)         /*!< 0x00000080 */
#define SDADC_JCHGR_JCHG_8            (0x100U << SDADC_JCHGR_JCHG_Pos)         /*!< 0x00000100 */

/******************  Bit definition for SDADC_CONF0R register  ****************/
#define SDADC_CONF0R_OFFSET0_Pos      (0U)                                     
#define SDADC_CONF0R_OFFSET0_Msk      (0xFFFU << SDADC_CONF0R_OFFSET0_Pos)     /*!< 0x00000FFF */
#define SDADC_CONF0R_OFFSET0          SDADC_CONF0R_OFFSET0_Msk                 /*!< 12-bit calibration offset for configuration 0 */
#define SDADC_CONF0R_GAIN0_Pos        (20U)                                    
#define SDADC_CONF0R_GAIN0_Msk        (0x7U << SDADC_CONF0R_GAIN0_Pos)         /*!< 0x00700000 */
#define SDADC_CONF0R_GAIN0            SDADC_CONF0R_GAIN0_Msk                   /*!< Gain setting for configuration 0 */
#define SDADC_CONF0R_GAIN0_0          (0x1U << SDADC_CONF0R_GAIN0_Pos)         /*!< 0x00100000 */
#define SDADC_CONF0R_GAIN0_1          (0x2U << SDADC_CONF0R_GAIN0_Pos)         /*!< 0x00200000 */
#define SDADC_CONF0R_GAIN0_2          (0x4U << SDADC_CONF0R_GAIN0_Pos)         /*!< 0x00400000 */
#define SDADC_CONF0R_SE0_Pos          (26U)                                    
#define SDADC_CONF0R_SE0_Msk          (0x3U << SDADC_CONF0R_SE0_Pos)           /*!< 0x0C000000 */
#define SDADC_CONF0R_SE0              SDADC_CONF0R_SE0_Msk                     /*!< Single ended mode for configuration 0 */
#define SDADC_CONF0R_SE0_0            (0x1U << SDADC_CONF0R_SE0_Pos)           /*!< 0x04000000 */
#define SDADC_CONF0R_SE0_1            (0x2U << SDADC_CONF0R_SE0_Pos)           /*!< 0x08000000 */
#define SDADC_CONF0R_COMMON0_Pos      (30U)                                    
#define SDADC_CONF0R_COMMON0_Msk      (0x3U << SDADC_CONF0R_COMMON0_Pos)       /*!< 0xC0000000 */
#define SDADC_CONF0R_COMMON0          SDADC_CONF0R_COMMON0_Msk                 /*!< Common mode for configuration 0 */
#define SDADC_CONF0R_COMMON0_0        (0x1U << SDADC_CONF0R_COMMON0_Pos)       /*!< 0x40000000 */
#define SDADC_CONF0R_COMMON0_1        (0x2U << SDADC_CONF0R_COMMON0_Pos)       /*!< 0x80000000 */

/******************  Bit definition for SDADC_CONF1R register  ****************/
#define SDADC_CONF1R_OFFSET1_Pos      (0U)                                     
#define SDADC_CONF1R_OFFSET1_Msk      (0xFFFU << SDADC_CONF1R_OFFSET1_Pos)     /*!< 0x00000FFF */
#define SDADC_CONF1R_OFFSET1          SDADC_CONF1R_OFFSET1_Msk                 /*!< 12-bit calibration offset for configuration 1 */
#define SDADC_CONF1R_GAIN1_Pos        (20U)                                    
#define SDADC_CONF1R_GAIN1_Msk        (0x7U << SDADC_CONF1R_GAIN1_Pos)         /*!< 0x00700000 */
#define SDADC_CONF1R_GAIN1            SDADC_CONF1R_GAIN1_Msk                   /*!< Gain setting for configuration 1 */
#define SDADC_CONF1R_GAIN1_0          (0x1U << SDADC_CONF1R_GAIN1_Pos)         /*!< 0x00100000 */
#define SDADC_CONF1R_GAIN1_1          (0x2U << SDADC_CONF1R_GAIN1_Pos)         /*!< 0x00200000 */
#define SDADC_CONF1R_GAIN1_2          (0x4U << SDADC_CONF1R_GAIN1_Pos)         /*!< 0x00400000 */
#define SDADC_CONF1R_SE1_Pos          (26U)                                    
#define SDADC_CONF1R_SE1_Msk          (0x3U << SDADC_CONF1R_SE1_Pos)           /*!< 0x0C000000 */
#define SDADC_CONF1R_SE1              SDADC_CONF1R_SE1_Msk                     /*!< Single ended mode for configuration 1 */
#define SDADC_CONF1R_SE1_0            (0x1U << SDADC_CONF1R_SE1_Pos)           /*!< 0x04000000 */
#define SDADC_CONF1R_SE1_1            (0x2U << SDADC_CONF1R_SE1_Pos)           /*!< 0x08000000 */
#define SDADC_CONF1R_COMMON1_Pos      (30U)                                    
#define SDADC_CONF1R_COMMON1_Msk      (0x3U << SDADC_CONF1R_COMMON1_Pos)       /*!< 0xC0000000 */
#define SDADC_CONF1R_COMMON1          SDADC_CONF1R_COMMON1_Msk                 /*!< Common mode for configuration 1 */
#define SDADC_CONF1R_COMMON1_0        (0x1U << SDADC_CONF1R_COMMON1_Pos)       /*!< 0x40000000 */
#define SDADC_CONF1R_COMMON1_1        (0x2U << SDADC_CONF1R_COMMON1_Pos)       /*!< 0x80000000 */

